"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь:
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    inp=int(input("Введите свой возраст:"))

    def guess_age(inp):

        if inp<=6:
            print ("Ходить в детский сад")
        elif 7 <= inp <= 17:
            print("Учиться в школе")
        elif inp>=18 and inp<=25:
            print("Учиться в институте")
        else:
            print("работать")

    guess_age(inp)
if __name__ == "__main__":
    main()
