"""

Домашнее задание №1

Цикл for: Оценки

* Создать список из словарей с оценками учеников разных классов
  школы вида [{'school_class': '4a', 'scores': [3,4,4,5,2]}, ...]
* Посчитать и вывести средний балл по всей школе.
* Посчитать и вывести средний балл по каждому классу.
"""

def main():
    """
    Эта функция вызывается автоматически при запуске скрипта в консоли
    В ней надо заменить pass на ваш код
    """
    lst=[{'cl':'1a','scores':[3,4,5,2,5]},
         {'cl':'2a','scores':[3,4,5,2,5]},
         {'cl':'3a','scores':[3,2,3,2,5]},
         {'cl':'4a','scores':[3,4,3,1,5]}]

    count=0
    sum1=0
    for pupil in lst:
        for i in (pupil['scores']):
            sum1=sum1+i
            count=count+1
    print("Средняя оценка в школе: ",sum1/count)

    for pupil in lst:
        for e in [pupil]:
            print(e['cl'],sum(e['scores'])/len(e['scores']))





if __name__ == "__main__":
    main()
