"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например:
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user_dict() которая с помощью input() просит
  пользователя ввести вопрос, а затем, если вопрос есть в словаре,
  программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую

"""

def ask_user():
    """
    Замените pass на ваш код
    """
    dct=dict([('Как дела?','Хорошо!'),('Что делаешь?','Программирую'),('Когда ложишься спать?','Рано'),('Ты поел?','да')])
    # inp=input("Введите вопрос")
    while True:
        inp = input("Введите вопрос")
        if inp in dct:
            print(dct.get(inp))
            break


if __name__ == "__main__":
    ask_user()
